loadtest/results/20260922-115848/3-mixed-95r-5w.txt
Running 1m test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 100 connections
  Thread calibration: mean lat.: 825.518ms, rate sampling interval: 2920ms
  Thread calibration: mean lat.: 769.368ms, rate sampling interval: 2738ms
  Thread calibration: mean lat.: 762.458ms, rate sampling interval: 2715ms
  Thread calibration: mean lat.: 818.385ms, rate sampling interval: 2789ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   135.22ms  121.54ms   1.72s    93.66%
    Req/Sec   125.93      4.91   144.00     87.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   94.59ms
 75.000%  136.06ms
 90.000%  180.48ms
 99.000%  791.04ms
 99.900%    1.02s 
 99.990%    1.45s 
 99.999%    1.72s 
100.000%    1.72s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      73.791     0.000000            1         1.00
      82.175     0.100000         2555         1.11
      84.735     0.200000         5091         1.25
      87.167     0.300000         7593         1.43
      90.047     0.400000        10101         1.67
      94.591     0.500000        12604         2.00
      98.047     0.550000        13865         2.22
     103.807     0.600000        15113         2.50
     111.871     0.650000        16380         2.86
     122.559     0.700000        17633         3.33
     136.063     0.750000        18896         4.00
     142.847     0.775000        19523         4.44
     148.863     0.800000        20159         5.00
     155.391     0.825000        20783         5.71
     162.431     0.850000        21416         6.67
     169.471     0.875000        22042         8.00
     173.695     0.887500        22351         8.89
     180.479     0.900000        22663        10.00
     196.223     0.912500        22977        11.43
     216.959     0.925000        23293        13.33
     258.559     0.937500        23609        16.00
     283.647     0.943750        23764        17.78
     320.767     0.950000        23921        20.00
     365.567     0.956250        24079        22.86
     417.535     0.962500        24236        26.67
     486.911     0.968750        24394        32.00
     518.655     0.971875        24472        35.56
     561.663     0.975000        24551        40.00
     617.983     0.978125        24630        45.71
     664.063     0.981250        24709        53.33
     687.103     0.984375        24787        64.00
     710.655     0.985938        24826        71.11
     749.055     0.987500        24868        80.00
     780.799     0.989062        24905        91.43
     795.647     0.990625        24946       106.67
     809.471     0.992188        24984       128.00
     824.319     0.992969        25004       142.22
     839.167     0.993750        25023       160.00
     850.943     0.994531        25043       182.86
     879.615     0.995313        25062       213.33
     899.583     0.996094        25083       256.00
     906.239     0.996484        25092       284.44
     923.135     0.996875        25102       320.00
     937.471     0.997266        25112       365.71
     943.615     0.997656        25121       426.67
     954.367     0.998047        25131       512.00
     959.999     0.998242        25136       568.89
     964.095     0.998437        25141       640.00
     976.895     0.998633        25147       731.43
     997.887     0.998828        25151       853.33
    1026.047     0.999023        25156      1024.00
    1031.679     0.999121        25158      1137.78
    1063.935     0.999219        25161      1280.00
    1086.463     0.999316        25163      1462.86
    1153.023     0.999414        25166      1706.67
    1186.815     0.999512        25168      2048.00
    1214.463     0.999561        25169      2275.56
    1229.823     0.999609        25171      2560.00
    1230.847     0.999658        25172      2925.71
    1290.239     0.999707        25173      3413.33
    1296.383     0.999756        25174      4096.00
    1319.935     0.999780        25175      4551.11
    1347.583     0.999805        25176      5120.00
    1347.583     0.999829        25176      5851.43
    1453.055     0.999854        25177      6826.67
    1453.055     0.999878        25177      8192.00
    1546.239     0.999890        25178      9102.22
    1546.239     0.999902        25178     10240.00
    1546.239     0.999915        25178     11702.86
    1652.735     0.999927        25179     13653.33
    1652.735     0.999939        25179     16384.00
    1652.735     0.999945        25179     18204.44
    1652.735     0.999951        25179     20480.00
    1652.735     0.999957        25179     23405.71
    1720.319     0.999963        25180     27306.67
    1720.319     1.000000        25180          inf
#[Mean    =      135.217, StdDeviation   =      121.541]
#[Max     =     1719.296, Total count    =        25180]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29844 requests in 1.00m, 10.05MB read
  Non-2xx or 3xx responses: 1229
Requests/sec:    496.45
Transfer/sec:    171.16KB
------------------------------
X-Cache  HIT=24157  MISS=2978  BYPASS=0  writes=1480  http_errors=1229
Cache hit ratio: 89.03%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       94.59 ms
p90      180.48 ms
p99      791.04 ms
p99.9   1019.90 ms