loadtest/results/20260922-115848/4-step-1000rps.txt
Running 30s test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 100 connections
  Thread calibration: mean lat.: 2254.470ms, rate sampling interval: 7835ms
  Thread calibration: mean lat.: 2502.419ms, rate sampling interval: 8601ms
  Thread calibration: mean lat.: 2502.703ms, rate sampling interval: 8658ms
  Thread calibration: mean lat.: 2484.059ms, rate sampling interval: 8593ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.21s   645.73ms   8.51s    73.87%
    Req/Sec   222.12      7.90   230.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.12s 
 75.000%    6.46s 
 90.000%    7.14s 
 99.000%    8.13s 
 99.900%    8.38s 
 99.990%    8.50s 
 99.999%    8.52s 
100.000%    8.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4620.287     0.000000            1         1.00
    5505.023     0.100000         1708         1.11
    5709.823     0.200000         3440         1.25
    5873.663     0.300000         5140         1.43
    6012.927     0.400000         6837         1.67
    6115.327     0.500000         8530         2.00
    6164.479     0.550000         9375         2.22
    6217.727     0.600000        10245         2.50
    6279.167     0.650000        11066         2.86
    6356.991     0.700000        11911         3.33
    6463.487     0.750000        12762         4.00
    6545.407     0.775000        13195         4.44
    6619.135     0.800000        13615         5.00
    6701.055     0.825000        14050         5.71
    6795.263     0.850000        14462         6.67
    6930.431     0.875000        14894         8.00
    7024.639     0.887500        15103         8.89
    7139.327     0.900000        15318        10.00
    7245.823     0.912500        15527        11.43
    7352.319     0.925000        15745        13.33
    7458.815     0.937500        15954        16.00
    7520.255     0.943750        16057        17.78
    7581.695     0.950000        16170        20.00
    7643.135     0.956250        16272        22.86
    7725.055     0.962500        16386        26.67
    7806.975     0.968750        16484        32.00
    7839.743     0.971875        16538        35.56
    7884.799     0.975000        16592        40.00
    7921.663     0.978125        16643        45.71
    7991.295     0.981250        16698        53.33
    8036.351     0.984375        16754        64.00
    8060.927     0.985938        16776        71.11
    8093.695     0.987500        16806        80.00
    8114.175     0.989062        16834        91.43
    8138.751     0.990625        16859       106.67
    8171.519     0.992188        16882       128.00
    8191.999     0.992969        16896       142.22
    8200.191     0.993750        16909       160.00
    8212.479     0.994531        16923       182.86
    8228.863     0.995313        16935       213.33
    8245.247     0.996094        16948       256.00
    8257.535     0.996484        16955       284.44
    8278.015     0.996875        16961       320.00
    8290.303     0.997266        16968       365.71
    8310.783     0.997656        16975       426.67
    8355.839     0.998047        16982       512.00
    8364.031     0.998242        16989       568.89
    8364.031     0.998437        16989       640.00
    8372.223     0.998633        16994       731.43
    8376.319     0.998828        16995       853.33
    8384.511     0.999023        16998      1024.00
    8396.799     0.999121        17003      1137.78
    8396.799     0.999219        17003      1280.00
    8396.799     0.999316        17003      1462.86
    8404.991     0.999414        17005      1706.67
    8429.567     0.999512        17006      2048.00
    8478.719     0.999561        17009      2275.56
    8478.719     0.999609        17009      2560.00
    8478.719     0.999658        17009      2925.71
    8486.911     0.999707        17011      3413.33
    8486.911     0.999756        17011      4096.00
    8486.911     0.999780        17011      4551.11
    8486.911     0.999805        17011      5120.00
    8495.103     0.999829        17012      5851.43
    8495.103     0.999854        17012      6826.67
    8495.103     0.999878        17012      8192.00
    8511.487     0.999890        17013      9102.22
    8511.487     0.999902        17013     10240.00
    8511.487     0.999915        17013     11702.86
    8511.487     0.999927        17013     13653.33
    8511.487     0.999939        17013     16384.00
    8519.679     0.999945        17014     18204.44
    8519.679     1.000000        17014          inf
#[Mean    =     6205.330, StdDeviation   =      645.730]
#[Max     =     8511.488, Total count    =        17014]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  21812 requests in 30.02s, 7.40MB read
  Non-2xx or 3xx responses: 2552
Requests/sec:    726.60
Transfer/sec:    252.33KB
------------------------------
X-Cache  HIT=18693  MISS=567  BYPASS=0  writes=0  http_errors=2552
Cache hit ratio: 97.06%
Socket errors: connect=0 read=0 write=0 timeout=0
p50     6115.33 ms
p90     7139.33 ms
p99     8126.46 ms
p99.9   8380.42 ms